Tekla.Structures.CatalogInternal.EventHandler
EventHandler is a class that TS calls when an event is raised.

Tekla.Structures.CatalogInternal.EventHandler.OnEvent(System.String)
TS calls when event is raised.
param: Name of the event
Returns: 1